app/controllers/categories_controller.rb

  def index
  	@categories=(Category.all)
---
SELECT "categories".* FROM "categories"

  def show
  	@category=Category.find(params[:id])
  	@items = (@category.items).order(count: :DESC)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "categories_items" ON "items"."id" = "categories_items"."item_id" WHERE "categories_items"."category_id" = ? ORDER BY "items"."count" DESC  [["category_id", 1]]