app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC
---
	def index
		@items=(Item.all).order(created_at: :DESC)

SELECT "items".* FROM "items" ORDER BY "items"."score" DESC
---
	def rating
		@items=(Item.all).order(score: :DESC)

SELECT "categories".* FROM "categories"
---
	def new
		@categories=Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "items" ("name", "description", "count", "cost", "created_at", "updated_at", "photos") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@categories=Category.find(params[:category_ids])
		@item = Item.create(item_params)

SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."item_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 4], ["item_id", 3], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "item_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["item_id", 1], ["score", 1], ["created_at", "2018-06-15 18:32:52.495919"], ["updated_at", "2018-06-15 18:32:52.495919"]]
UPDATE "items" SET "score" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["score", 1], ["updated_at", "2018-06-15 18:32:52.570847"], ["id", 1]]
UPDATE "votes" SET "score" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["score", 1], ["updated_at", "2018-06-15 19:51:28.316125"], ["id", 1]]
SELECT SUM("votes"."score") FROM "votes" WHERE "votes"."item_id" = ?  [["item_id", 3]]
UPDATE "userparams" SET "rate" = ?, "updated_at" = ? WHERE "userparams"."id" = ?  [["rate", 1], ["updated_at", "2018-06-19 00:29:20.048523"], ["id", 1]]
---
	def positiv_vote
		@vote = Vote.where(user_id: current_user.id,item_id: @item.id).first
		if current_user.id != @user
			if @vote==nil
				@vote=Vote.create(user_id: current_user.id,item_id: @item.id,score: 1)
	    	else
	    		@item.score-=@vote.score
	    		if @vote.score == -1
	    	    	@vote.update(score: 0)
	        	else
	        		@vote.update(score: 1)
	        	end
	    	end
	    end
	    @item.update(score: Vote.where(item_id: @item.id).sum(:score))
	    current_user.userparam.update(rate: Vote.where(item_id: @item.id).sum(:score))

SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."item_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 4], ["item_id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "item_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["item_id", 1], ["score", -1], ["created_at", "2018-06-15 18:32:54.839685"], ["updated_at", "2018-06-15 18:32:54.839685"]]
UPDATE "items" SET "score" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["score", 0], ["updated_at", "2018-06-15 18:32:55.333935"], ["id", 1]]
UPDATE "votes" SET "score" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["score", 0], ["updated_at", "2018-06-15 19:51:26.134263"], ["id", 1]]
SELECT SUM("votes"."score") FROM "votes" WHERE "votes"."item_id" = ?  [["item_id", 3]]
---
	def negativ_vote
		@vote = Vote.where(user_id: current_user.id,item_id: @item.id).first
		if current_user.id != @user
			if @vote==nil
		    	@vote=Vote.create(user_id: current_user.id,item_id: @item.id,score: -1)
		    else
	    		@item.score-=@vote.score
	    		if @vote.score == 1
		    	    @vote.update(score: 0)
	    	    else
	        		@vote.update(score: -1)
		        end
		    end
	    end
	   	@item.update(score: Vote.where(item_id: @item.id).sum(:score))