app/controllers/userparams_controller.rb

	def update
		@userparam.update(userparam_params)
---
UPDATE "userparams" SET "bio" = ?, "phone" = ?, "updated_at" = ? WHERE "userparams"."id" = ?  [["bio", "sss"], ["phone", "+380969587744"], ["updated_at", "2018-06-19 00:20:25.280094"], ["id", 1]]