app/views/categories/index.html.erb

        	<%end%>
    		<i class="itcount">Count of products: <%=category.items.count%></i>
---
SELECT COUNT(*) FROM "items" INNER JOIN "categories_items" ON "items"."id" = "categories_items"."item_id" WHERE "categories_items"."category_id" = ?  [["category_id", 11]]